<a href="https://colab.research.google.com/github/Uh-hub/avocado/blob/circleci-project-setup/(study1)titanic_age_model.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#어떤 승객이 살아남고 어떤 승객이 죽었는지 판단하는 게 목적
import pandas as pd

train = pd.read_csv('./train.csv')
test = pd.read_csv('./test.csv')

train.head(50) #전부 불러오는데 시간이 걸리기 때문에 간략
#NaN : not a number

    PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
0             1         0       3  ...    7.2500          NaN         S
1             2         1       1  ...   71.2833          C85         C
2             3         1       3  ...    7.9250          NaN         S
3             4         1       1  ...   53.1000         C123         S
4             5         0       3  ...    8.0500          NaN         S
5             6         0       3  ...    8.4583          NaN         Q
6             7         0       1  ...   51.8625          E46         S
7             8         0       3  ...   21.0750          NaN         S
8             9         1       3  ...   11.1333          NaN         S
9            10         1       2  ...   30.0708          NaN         C
10           11         1       3  ...   16.7000           G6         S
11           12         1       1  ...   26.5500         C103         S
12           13         0       3  ...    8.0500          NaN         S
13           14         0       3  ...   31.2750          NaN         S
14           15         0       3  ...    7.8542          NaN         S
15           16         1       2  ...   16.0000          NaN         S
16           17         0       3  ...   29.1250          NaN         Q
17           18         1       2  ...   13.0000          NaN         S
18           19         0       3  ...   18.0000          NaN         S
19           20         1       3  ...    7.2250          NaN         C
20           21         0       2  ...   26.0000          NaN         S
21           22         1       2  ...   13.0000          D56         S
22           23         1       3  ...    8.0292          NaN         Q
23           24         1       1  ...   35.5000           A6         S
24           25         0       3  ...   21.0750          NaN         S
25           26         1       3  ...   31.3875          NaN         S
26           27         0       3  ...    7.2250          NaN         C
27           28         0       1  ...  263.0000  C23 C25 C27         S
28           29         1       3  ...    7.8792          NaN         Q
29           30         0       3  ...    7.8958          NaN         S
30           31         0       1  ...   27.7208          NaN         C
31           32         1       1  ...  146.5208          B78         C
32           33         1       3  ...    7.7500          NaN         Q
33           34         0       2  ...   10.5000          NaN         S
34           35         0       1  ...   82.1708          NaN         C
35           36         0       1  ...   52.0000          NaN         S
36           37         1       3  ...    7.2292          NaN         C
37           38         0       3  ...    8.0500          NaN         S
38           39         0       3  ...   18.0000          NaN         S
39           40         1       3  ...   11.2417          NaN         C
40           41         0       3  ...    9.4750          NaN         S
41           42         0       2  ...   21.0000          NaN         S
42           43         0       3  ...    7.8958          NaN         C
43           44         1       2  ...   41.5792          NaN         C
44           45         1       3  ...    7.8792          NaN         Q
45           46         0       3  ...    8.0500          NaN         S
46           47         0       3  ...   15.5000          NaN         Q
47           48         1       3  ...    7.7500          NaN         Q
48           49         0       3  ...   21.6792          NaN         C
49           50         0       3  ...   17.8000          NaN         S

[50 rows x 12 columns]

In [ ]:
import tensorflow as tf
import numpy as np

#여기에서는 필요한 열 뽑기
train = train[['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']]
test = test[['Pclass', 'Sex','Age','SibSp','Parch','Fare','Embarked']]

#dummies  pclass랑 sex는 원핫 인코딩 (test,train 모두)
train = pd.get_dummies(train, columns = ['Pclass']) 
train = pd.get_dummies(train, columns = ['Sex'])

test = pd.get_dummies(test, columns = ['Pclass'])
test = pd.get_dummies(test, columns = ['Sex'])


#embark 결측치 행 2개 제거(train)
train['Embarked'].dropna(axis=0)

#dummies  pclass랑 sex는 원핫 인코딩 (test,train 모두)
train = pd.get_dummies(train, columns = ['Embarked'])
test = pd.get_dummies(test, columns = ['Embarked'])



# train = train.dropna(axis=0)
# print(train.info())

#Family_SIze = SibSp + Parch(train)
Family_Size =  train['SibSp'] + train['Parch']
train['Family Size'] = Family_Size
train = train.drop(['SibSp', 'Parch'], axis = 1)

#Family_SIze = SibSp + Parch(test)
Family_Size =  test['SibSp'] + test['Parch']
test['Family Size'] = Family_Size
test = test.drop(['SibSp', 'Parch'], axis = 1)

train.head(50)

    Survived   Age      Fare  ...  Embarked_Q  Embarked_S  Family Size
0          0  22.0    7.2500  ...           0           1            1
1          1  38.0   71.2833  ...           0           0            1
2          1  26.0    7.9250  ...           0           1            0
3          1  35.0   53.1000  ...           0           1            1
4          0  35.0    8.0500  ...           0           1            0
5          0   NaN    8.4583  ...           1           0            0
6          0  54.0   51.8625  ...           0           1            0
7          0   2.0   21.0750  ...           0           1            4
8          1  27.0   11.1333  ...           0           1            2
9          1  14.0   30.0708  ...           0           0            1
10         1   4.0   16.7000  ...           0           1            2
11         1  58.0   26.5500  ...           0           1            0
12         0  20.0    8.0500  ...           0           1            0
13         0  39.0   31.2750  ...           0           1            6
14         0  14.0    7.8542  ...           0           1            0
15         1  55.0   16.0000  ...           0           1            0
16         0   2.0   29.1250  ...           1           0            5
17         1   NaN   13.0000  ...           0           1            0
18         0  31.0   18.0000  ...           0           1            1
19         1   NaN    7.2250  ...           0           0            0
20         0  35.0   26.0000  ...           0           1            0
21         1  34.0   13.0000  ...           0           1            0
22         1  15.0    8.0292  ...           1           0            0
23         1  28.0   35.5000  ...           0           1            0
24         0   8.0   21.0750  ...           0           1            4
25         1  38.0   31.3875  ...           0           1            6
26         0   NaN    7.2250  ...           0           0            0
27         0  19.0  263.0000  ...           0           1            5
28         1   NaN    7.8792  ...           1           0            0
29         0   NaN    7.8958  ...           0           1            0
30         0  40.0   27.7208  ...           0           0            0
31         1   NaN  146.5208  ...           0           0            1
32         1   NaN    7.7500  ...           1           0            0
33         0  66.0   10.5000  ...           0           1            0
34         0  28.0   82.1708  ...           0           0            1
35         0  42.0   52.0000  ...           0           1            1
36         1   NaN    7.2292  ...           0           0            0
37         0  21.0    8.0500  ...           0           1            0
38         0  18.0   18.0000  ...           0           1            2
39         1  14.0   11.2417  ...           0           0            1
40         0  40.0    9.4750  ...           0           1            1
41         0  27.0   21.0000  ...           0           1            1
42         0   NaN    7.8958  ...           0           0            0
43         1   3.0   41.5792  ...           0           0            3
44         1  19.0    7.8792  ...           1           0            0
45         0   NaN    8.0500  ...           0           1            0
46         0   NaN   15.5000  ...           1           0            1
47         1   NaN    7.7500  ...           1           0            0
48         0   NaN   21.6792  ...           0           0            2
49         0  18.0   17.8000  ...           0           1            1

[50 rows x 12 columns]

In [ ]:
test.head()

    Age     Fare  Pclass_1  ...  Embarked_Q  Embarked_S  Family Size
0  34.5   7.8292         0  ...           1           0            0
1  47.0   7.0000         0  ...           0           1            1
2  62.0   9.6875         0  ...           1           0            0
3  27.0   8.6625         0  ...           0           1            0
4  22.0  12.2875         0  ...           0           1            2

[5 rows x 11 columns]

In [ ]:
#survive를 뺀 df를 새로 만든 후 age를 맨앞으로 이동(train)
age_df = train[['Age', 'Fare',	'Pclass_1',	'Pclass_2',	'Pclass_3',	'Sex_female',	'Sex_male',	'Embarked_C',	'Embarked_Q',	'Embarked_S',	'Family Size']]
age_df = age_df.sort_values(by=['Age'], axis=0, na_position='last')
age_df.head()
#이거 index가 그대로인데 이거 바꿀 수 없나?

      Age     Fare  Pclass_1  ...  Embarked_Q  Embarked_S  Family Size
803  0.42   8.5167         0  ...           0           0            1
755  0.67  14.5000         0  ...           0           1            2
644  0.75  19.2583         0  ...           0           0            3
469  0.75  19.2583         0  ...           0           0            3
78   0.83  29.0000         0  ...           0           1            2

[5 rows x 11 columns]

In [ ]:
age_nan_index = age_df.loc[age_df['Age'].isnull()]
for index in age_nan_index:
  age

     Age     Fare  Pclass_1  ...  Embarked_Q  Embarked_S  Family Size
5    NaN   8.4583         0  ...           1           0            0
17   NaN  13.0000         0  ...           0           1            0
19   NaN   7.2250         0  ...           0           0            0
26   NaN   7.2250         0  ...           0           0            0
28   NaN   7.8792         0  ...           1           0            0
..   ...      ...       ...  ...         ...         ...          ...
859  NaN   7.2292         0  ...           0           0            0
863  NaN  69.5500         0  ...           0           1           10
868  NaN   9.5000         0  ...           0           1            0
878  NaN   7.8958         0  ...           0           1            0
888  NaN  23.4500         0  ...           0           1            3

[177 rows x 11 columns]